Can't Copy to Clipboard elements from the project and a link instance at the same time. Only elements from the project will be copied.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyFromProjectAndLink { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyFromProjectAndLink As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyFromProjectAndLink {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace